## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| add    | `aws_quicksight_data_set.notifications` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_quicksight_data_set.notifications will be created
  + resource "aws_quicksight_data_set" "notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notifications"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notifications"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration {
          + disable_use_as_direct_query_source = (known after apply)
          + disable_use_as_imported_source     = (known after apply)
        }

      + logical_table_map {
          + alias                = (known after apply)
          + logical_table_map_id = (known after apply)

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }

      + physical_table_map {
          + physical_table_map_id = "notifications"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "notifications"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

25 tests, 17 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
